gegel/onionphone/libcodecs/lpc10/analys.c
/*   Calculations are done on future frame due to requirements */
/*   of the pitch tracker.  Delay RMS and RC's 2 frames to give */
/*   current frame parameters on return. */
/*   Update all buffers */

	inbuf = &(st->inbuf[0]);
	pebuf = &(st->pebuf[0]);
	lpbuf = &(st->lpbuf[0]);
	ivbuf = &(st->ivbuf[0]);
	bias = &(st->bias);
	osbuf = &(st->osbuf[0]);
	osptr = &(st->osptr);
	obound = &(st->obound[0]);
	vwin = &(st->vwin[0]);
	awin = &(st->awin[0]);
	voibuf = &(st->voibuf[0]);
	rmsbuf = &(st->rmsbuf[0]);
	rcbuf = &(st->rcbuf[0]);
	zpre = &(st->zpre);

	i__1 = 720 - contrl_1.lframe;
	for (i__ = 181; i__ <= i__1; ++i__) {
		inbuf[i__ - 181] = inbuf[contrl_1.lframe + i__ - 181];
		pebuf[i__ - 181] = pebuf[contrl_1.lframe + i__ - 181];
	}
	i__1 = 540 - contrl_1.lframe;
	for (i__ = 229; i__ <= i__1; ++i__) {
		ivbuf[i__ - 229] = ivbuf[contrl_1.lframe + i__ - 229];
	}
	i__1 = 720 - contrl_1.lframe;
	for (i__ = 25; i__ <= i__1; ++i__) {
		lpbuf[i__ - 25] = lpbuf[contrl_1.lframe + i__ - 25];
	}
	j = 1;
	i__1 = (*osptr) - 1;
	for (i__ = 1; i__ <= i__1; ++i__) {
		if (osbuf[i__ - 1] > contrl_1.lframe) {
			osbuf[j - 1] = osbuf[i__ - 1] - contrl_1.lframe;
			++j;
		}
	}
	*osptr = j;
	voibuf[0] = voibuf[2];
	voibuf[1] = voibuf[3];
	for (i__ = 1; i__ <= 2; ++i__) {
		vwin[(i__ << 1) - 2] =
		    vwin[((i__ + 1) << 1) - 2] - contrl_1.lframe;
		vwin[(i__ << 1) - 1] =
		    vwin[((i__ + 1) << 1) - 1] - contrl_1.lframe;
		awin[(i__ << 1) - 2] =
		    awin[((i__ + 1) << 1) - 2] - contrl_1.lframe;
		awin[(i__ << 1) - 1] =
		    awin[((i__ + 1) << 1) - 1] - contrl_1.lframe;
/*       EWIN(*,J) is unused for J .NE. AF, so the following shift is 
*/
/*       unnecessary.  It also causes error messages when the C versio
n */
/*       of the code created from this by f2c is run with Purify.  It 
*/
/*       correctly complains that uninitialized memory is being read. 
*/
/* 	   EWIN(1,I) = EWIN(1,I+1) - LFRAME */
/* 	   EWIN(2,I) = EWIN(2,I+1) - LFRAME */
		obound[i__ - 1] = obound[i__];
		voibuf[i__ * 2] = voibuf[(i__ + 1) * 2];
		voibuf[(i__ << 1) + 1] = voibuf[((i__ + 1) << 1) + 1];
		rmsbuf[i__ - 1] = rmsbuf[i__];
		i__1 = contrl_1.order;
		for (j = 1; j <= i__1; ++j) {
			rcbuf[j + i__ * 10 - 11] =
			    rcbuf[j + (i__ + 1) * 10 - 11];
		}
	}
/*   Copy input speech, scale to sign+12 bit int32_ts */
/*   Remove long term DC bias. */
/*       If the average value in the frame was over 1/4096 (after current 
*/
/*       BIAS correction), then subtract that much more from samples in */
/*       next frame.  If the average value in the frame was under */
/*       -1/4096, add 1/4096 more to samples in next frame.  In all other 
*/
/*       cases, keep BIAS the same. */
	temp = 0.f;
	i__1 = contrl_1.lframe;
	for (i__ = 1; i__ <= i__1; ++i__) {
		inbuf[720 - contrl_1.lframe + i__ - 181] =
		    speech[i__] * 4096.f - (*bias);
		temp += inbuf[720 - contrl_1.lframe + i__ - 181];
	}
	if (temp > (float)contrl_1.lframe) {
		*bias += 1;
	}
	if (temp < (float)(-contrl_1.lframe)) {
		*bias += -1;
	}
/*   Place Voicing Window */
	i__ = 721 - contrl_1.lframe;
	preemp_(&inbuf[i__ - 181], &pebuf[i__ - 181], &contrl_1.lframe,
		&precoef, zpre);
	onset_(pebuf, osbuf, osptr, &c__10, &c__181, &c__720, &contrl_1.lframe,
	       st);

/*       MAXOSP is just a debugging variable. */

/* 	MAXOSP = MAX( MAXOSP, OSPTR ) */

	placev_(osbuf, osptr, &c__10, &obound[2], vwin, &c__3, &contrl_1.lframe,
		&c__90, &c__156, &c__307, &c__462);
/*        The Pitch Extraction algorithm estimates the pitch for a frame 
*/
/*   of speech by locating the minimum of the average magnitude difference
 */
/*   function (AMDF).  The AMDF operates on low-pass, inverse filtered */
/*   speech.  (The low-pass filter is an 800 Hz, 19 tap, equiripple, FIR 
*/
/*   filter and the inverse filter is a 2nd-order LPC filter.)  The pitch 
*/
/*   estimate is later refined by dynamic programming (DYPTRK).  However, 
*/
/*   since some of DYPTRK's parameters are a function of the voicing */
/*  decisions, a voicing decision must precede the final pitch estimation.
*/
/*   See subroutines LPFILT, IVFILT, and TBDM. */
/*       LPFILT reads indices LBUFH-LFRAME-29 = 511 through LBUFH = 720 */
/*       of INBUF, and writes indices LBUFH+1-LFRAME = 541 through LBUFH 
*/
/*       = 720 of LPBUF. */
	lpfilt_(&inbuf[228], &lpbuf[384], &c__312, &contrl_1.lframe);
/*       IVFILT reads indices (PWINH-LFRAME-7) = 353 through PWINH = 540 
*/
/*       of LPBUF, and writes indices (PWINH-LFRAME+1) = 361 through */
/*       PWINH = 540 of IVBUF. */
	ivfilt_(&lpbuf[204], ivbuf, &c__312, &contrl_1.lframe, ivrc);
/*       TBDM reads indices PWINL = 229 through */
/*       (PWINL-1)+MAXWIN+(TAU(LTAU)-TAU(1))/2 = 452 of IVBUF, and writes 
*/
/*       indices 1 through LTAU = 60 of AMDF. */
	tbdm_(ivbuf, &c__156, tau, &c__60, amdf, &minptr, &maxptr, &mintau);
/*        Voicing decisions are made for each half frame of input speech. 
*/
/*   An initial voicing classification is made for each half of the */
/*   analysis frame, and the voicing decisions for the present frame */
/*   are finalized.  See subroutine VOICIN. */
/*        The voicing detector (VOICIN) classifies the input signal as */
/*   unvoiced (including silence) or voiced using the AMDF windowed */
/*   maximum-to-minimum ratio, the zero crossing rate, energy measures, */
/*   reflection coefficients, and prediction gains. */
/*        The pitch and voicing rules apply smoothing and isolated */
/*   corrections to the pitch and voicing estimates and, in the process, 
*/
/*   introduce two frames of delay into the corrected pitch estimates and 
*/
/*   voicing decisions. */
	for (half = 1; half <= 2; ++half) {
		voicin_(&vwin[4], inbuf, lpbuf, buflim, &half,
			&amdf[minptr - 1], &amdf[maxptr - 1], &mintau, ivrc,
			obound, voibuf, &c__3, st);
	}
/*   Find the minimum cost pitch decision over several frames */
/*   given the current voicing decision and the AMDF array */
	dyptrk_(amdf, &c__60, &minptr, &voibuf[7], pitch, &midx, st);
	ipitch = tau[midx - 1];
/*   Place spectrum analysis and energy windows */
	placea_(&ipitch, voibuf, &obound[2], &c__3, vwin, awin, ewin,
		&contrl_1.lframe, &c__156);
/*  Remove short term DC bias over the analysis window, Put result in ABUF
*/
	lanal = awin[5] + 1 - awin[4];
	dcbias_(&lanal, &pebuf[awin[4] - 181], abuf);
/*       ABUF(1:LANAL) is now defined.  It is equal to */
/*       PEBUF(AWIN(1,AF):AWIN(2,AF)) corrected for short term DC bias. */
/*   Compute RMS over int32_t number of pitch periods within the */
/*   analysis window. */
/*   Note that in a hardware implementation this computation may be */
/*   simplified by using diagonal elements of PHI computed by MLOAD. */
	i__1 = ewin[5] - ewin[4] + 1;
	energy_(&i__1, &abuf[ewin[4] - awin[4]], &rmsbuf[2]);
/*   Matrix load and invert, check RC's for stability */
	mload_(&contrl_1.order, &c__1, &lanal, abuf, phi, psi);
	invert_(&contrl_1.order, phi, psi, &rcbuf[20]);
	rcchk_(&contrl_1.order, &rcbuf[10], &rcbuf[20]);
/*   Set return parameters */
	voice[1] = voibuf[2];
	voice[2] = voibuf[3];
	*rms = rmsbuf[0];
	i__1 = contrl_1.order;
	for (i__ = 1; i__ <= i__1; ++i__) {
		rc[i__] = rcbuf[i__ - 1];
	}
	return 0;
}				/* analys_ */
